 ![png](books_ERD_image.png)

In [1]:
#imports
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost:3306/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [4]:
q= '''SELECT * FROM books'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [book_id, title, authors_author_id]
Index: []

In [5]:
# Read in the book data and preview
books = pd.read_csv('books - books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [6]:
# Read in the authors data and preview
authors = pd.read_csv('authors - authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [7]:
# Read in the users data and preview
users = pd.read_csv('users  - users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [8]:
# Read in the favorites data and preview
favorites = pd.read_csv('favorites - favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [9]:
#Check the books table
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

               Field         Type Null  Key Default           Extra
0            book_id          int   NO  PRI    None  auto_increment
1              title  varchar(45)  YES         None
2  authors_author_id          int   NO  MUL    None

In [10]:
#Rename columns in users table
users.columns = ['user_id', 'first_name', 'last_name',"email"]

In [11]:
users

   user_id first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       Robin@books.com
2        3     Gloria  Rodriguez  grodriquez@books.com

In [12]:
#Rename columns in books table
books.columns = ['book_id', 'title', 'authors_author_id']

In [13]:
books

   book_id                 title  authors_author_id
0        1           The Shining                  1
1        2                    It                  1
2        3      The Great Gatsby                  2
3        4  The Call of the Wild                  3
4        5   Pride and Prejudice                  4
5        6          Frankenstein                  5

In [14]:
#Rename columns in authors table
authors.columns = ['author_id', 'author_name']

In [15]:
authors

   author_id        author_name
0          1       Stephen King
1          2  F.Scott Fitgerald
2          3        Jack London
3          4        Jane Austen
4          5       Mary Shelley

In [16]:
#Rename columns in favorites table
favorites.columns = ['books_book_id', 'users_user_id']

In [17]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

               Field         Type Null  Key Default           Extra
0            book_id          int   NO  PRI    None  auto_increment
1              title  varchar(45)  YES         None
2  authors_author_id          int   NO  MUL    None

In [18]:
#Check the users table
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default           Extra
0     user_id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [19]:
#Check the authors table
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default           Extra
0    author_id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

### Check the datatypes in each table column

In [20]:
books.dtypes

book_id               int64
title                object
authors_author_id     int64
dtype: object

In [21]:
authors.dtypes

author_id       int64
author_name    object
dtype: object

In [22]:
users.dtypes

user_id        int64
first_name    object
last_name     object
email         object
dtype: object

In [23]:
favorites.dtypes

books_book_id    int64
users_user_id    int64
dtype: object

In [24]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [25]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [26]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [27]:
# Inserting the books data now that foreign key checks are disabled
books.to_sql("books",conn,index=False, if_exists='append')

6

In [28]:
# Inserting the users data now that foreign key checks are disabled
users.to_sql("users",conn,index=False, if_exists='append')

3

In [29]:
# Inserting the authors data now that foreign key checks are disabled
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [30]:
# Inserting the favorites data now that foreign key checks are disabled
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [31]:
# confirm the data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

   book_id                 title  authors_author_id
0        1           The Shining                  1
1        2                    It                  1
2        3      The Great Gatsby                  2
3        4  The Call of the Wild                  3
4        5   Pride and Prejudice                  4
5        6          Frankenstein                  5

In [32]:
# check the describe again to confirm no changes
q = """DESCRIBE books;"""
pd.read_sql(q,conn)

               Field         Type Null  Key Default           Extra
0            book_id          int   NO  PRI    None  auto_increment
1              title  varchar(45)  YES         None
2  authors_author_id          int   NO  MUL    None

In [33]:
books

   book_id                 title  authors_author_id
0        1           The Shining                  1
1        2                    It                  1
2        3      The Great Gatsby                  2
3        4  The Call of the Wild                  3
4        5   Pride and Prejudice                  4
5        6          Frankenstein                  5

In [34]:
# confirm the data has been added
q = """SHOW TABLES;"""
pd.read_sql(q,conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [39]:
q = """SELECT books.title, favorites.users_user_id
FROM books
JOIN favorites ON books.book_id = favorites.books_book_id
WHERE favorites.users_user_id = 
    (SELECT users.user_id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""


pd.read_sql(q,conn)

         title  users_user_id
0  The Shining              1

In [40]:
#conn.close()